
'''
Способи передачі параметрів до функції - аргументи через інтерфейс (специфікацію)
'''


# Аргумент за замовчуванням -
# це параметр, який приймає значення за замовчуванням,
# якщо значення не вказано у виклику функції для цього аргументу.

def myFun(x, y=50):
    print("x: ", x)
    print("y: ", y)
    return

# Аргументи ключових слів
# Ідея полягає в тому, щоб дозволити  вказувати назву аргументу зі значеннями,
# щоб не потрібно було запам’ятовувати порядок параметрів.

def student(firstname, lastname):
    print(firstname, lastname)


# Позиційні аргументи
# Змінні чітко визначаються позицією

def nameAge(name, age):
    print("Hi, I am", name)
    print("My age is ", age)


